## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/57819960/runs/634092b0-e2d2-418c-893d-00c515588038).

This is a **layered run** with 1 layers remaining to apply.  Layered runs require multiple rounds of planning and applying.  After applying this layer, comment `terrateam plan` to plan the next layer and continue until all layers are applied.

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: layers/services | Success :thumbsup:
**Dir**: layers/services
**Workspace**: default
**Success**: :thumbsup:
**Command**: `tofu plan -detailed-exitcode -out /tmp/tmp_u_ru5zz/plan`

```diff

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.mysql_cluster.module.master.module.mysql_deployment.akash_deployment.service has been deleted
-   resource "akash_deployment" "service" {
-       deployment_state              = "active" -> null
-       id                            = "19248530:1:1:***:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn" -> null
-       services                      = [
-           {
-               available          = 1
-               available_replicas = 1
-               forwarded_ports    = [
-                   {
-                       external_port = 32747
-                       host          = "provider.ny-01.node.infra.lumeweb.com"
-                       port          = 3306
-                       proto         = "TCP"
                    },
                ]
-               ips                = []
-               name               = "mysql-master-dev-881856c4"
-               ready_replicas     = 0
-               replicas           = 1
-               total              = 1
-               updated_replicas   = 0
-               uris               = []
            },
        ] -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.mysql_cluster.module.slaves["0"].module.mysql_deployment.akash_deployment.service has been deleted
-   resource "akash_deployment" "service" {
-       deployment_state              = "active" -> null
-       id                            = "19248535:1:1:***:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn" -> null
-       services                      = [
-           {
-               available          = 1
-               available_replicas = 1
-               forwarded_ports    = [
-                   {
-                       external_port = 31874
-                       host          = "provider.ny-01.node.infra.lumeweb.com"
-                       port          = 3306
-                       proto         = "TCP"
                    },
                ]
-               ips                = []
-               name               = "mysql-slave-0-dev-454b0509"
-               ready_replicas     = 0
-               replicas           = 1
-               total              = 1
-               updated_replicas   = 0
-               uris               = []
            },
        ] -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service has changed
!   resource "akash_deployment" "service" {
        id                            = "19249343:1:1:***:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"
!       services                      = [
!           {
                name               = "renterd-autopilot-dev-adc6c7a3"
!               ready_replicas     = 0 -> 1
                # (8 unchanged attributes hidden)
            },
        ]
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service has changed
!   resource "akash_deployment" "service" {
        id                            = "19249340:1:1:***:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"
!       services                      = [
!           {
                name               = "renterd-worker-dev-8a7de8aa"
!               ready_replicas     = 0 -> 1
                # (8 unchanged attributes hidden)
            },
        ]
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

OpenTofu will perform the following actions:

  # module.proxysql.module.proxysql_deployment.akash_deployment.service will be updated in-place
!   resource "akash_deployment" "service" {
        id                            = "19248539:1:1:***:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"
!       sdl                           = (sensitive value)
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.mysql_cluster.module.master.module.mysql_deployment.akash_deployment.service will be created
+   resource "akash_deployment" "service" {
+       deployment_dseq               = (known after apply)
+       deployment_gseq               = (known after apply)
+       deployment_oseq               = (known after apply)
+       deployment_owner              = (known after apply)
+       deployment_state              = (known after apply)
+       escrow_account_balance_amount = (known after apply)
+       escrow_account_balance_denom  = (known after apply)
+       escrow_account_owner          = (known after apply)
+       id                            = (known after apply)
+       last_updated                  = (known after apply)
+       provider_address              = (known after apply)
+       sdl                           = (sensitive value)
+       services                      = (known after apply)

+       provider_filters {
+           enforce   = true
+           providers = [
+               "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.mysql_cluster.module.slaves["0"].module.mysql_deployment.akash_deployment.service will be created
+   resource "akash_deployment" "service" {
+       deployment_dseq               = (known after apply)
+       deployment_gseq               = (known after apply)
+       deployment_oseq               = (known after apply)
+       deployment_owner              = (known after apply)
+       deployment_state              = (known after apply)
+       escrow_account_balance_amount = (known after apply)
+       escrow_account_balance_denom  = (known after apply)
+       escrow_account_owner          = (known after apply)
+       id                            = (known after apply)
+       last_updated                  = (known after apply)
+       provider_address              = (known after apply)
+       sdl                           = (sensitive value)
+       services                      = (known after apply)

+       provider_filters {
+           enforce   = true
+           providers = [
+               "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Changes to Outputs:
!   mysql_cluster = {
!       master   = {
!           endpoint = "provider.ny-01.node.infra.lumeweb.com:32747" -> (known after apply)
!           host     = "provider.ny-01.node.infra.lumeweb.com" -> (known after apply)
!           port     = 32747 -> (known after apply)
        }
!       replicas = {
!           "0" = {
!               endpoint = "provider.ny-01.node.infra.lumeweb.com:31874" -> (known after apply)
!               host     = "provider.ny-01.node.infra.lumeweb.com" -> (known after apply)
!               port     = 31874 -> (known after apply)
            }
        }
        # (1 unchanged attribute hidden)
    }

```


</details>


---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
